# Πρώτο Εργαστήριο - ΜΕΜ205 Περιγραφική Στατιστική

## 1. Jupyter Notebook
Το Jupyter Notebook είναι μια δικτυακή εφαρμογή ανοικτού κώδικα που μας επιτρέπει να δημιουργούμε και να μοιράζομαστε έγγραφα που περιέχουν κώδικα, μαθηματικές εξισώσεις, γραφήματα και κείμενα. 



###  Γνωριμία με το jupyter notebook

#### Jupyter Modes
- Command Mode
- Edit Mode
  - Markdown
  - Code

#### Hello Jupyter Notebook - Markdown (latex)
  
  $$ \sum_{i=1}^N x_i$$
  
#### Hello Jupyter Notebook - Python
1. Γράφουμε κωδικά **Python** (μία ή περισσότερες γραμμές).
2. Εκτελούμε τον κώδικα με **Shift + Enter**.

In [1]:
print("Hello, Jupyter Notebook!")

Hello, Jupyter Notebook!

In [2]:
"Hello, Jupyter Notebook!"

'Hello, Jupyter Notebook!'

## 2. Εισαγωγή στο Pandas

In [2]:
import pandas as pd

### 2.1. DataFrame

In [4]:
data_1 = \
{
 'name': ['Nick', 'Helen', 'Steve', 'Mary', 'George'],
 'age': [20, 19, 22, 21, 20],
 'field_of_study': ['Mathematics', 'Physics', 'Literature', 'Mathematics', 'Chemistry'],
 'os': ['Windows', 'Windows', 'Windows', 'Linux', 'MacOS']
}

In [5]:
data_1

{'name': ['Nick', 'Helen', 'Steve', 'Mary', 'George'],
 'age': [20, 19, 22, 21, 20],
 'field_of_study': ['Mathematics',
  'Physics',
  'Literature',
  'Mathematics',
  'Chemistry'],
 'os': ['Windows', 'Windows', 'Windows', 'Linux', 'MacOS']}

In [6]:
dataset_1 = pd.DataFrame(data_1)

In [7]:
dataset_1

     name  age field_of_study       os
0    Nick   20    Mathematics  Windows
1   Helen   19        Physics  Windows
2   Steve   22     Literature  Windows
3    Mary   21    Mathematics    Linux
4  George   20      Chemistry    MacOS

In [8]:
dataset_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   name            5 non-null      object
 1   age             5 non-null      int64
 2   field_of_study  5 non-null      object
 3   os              5 non-null      object
dtypes: int64(1), object(3)
memory usage: 288.0+ bytes

In [9]:
data_2 = \
[['Nick', 20, 'Mathematics', 'Windows'],
 ['Helen', 19, 'Physics', 'Windows'],
 ['Steve', 22, 'Literature', 'Windows'],
 ['Mary', 21, 'Mathematics', 'Linux'],
 ['George', 20, 'Chemistry', 'MacOS']]

In [10]:
dataset_2a = pd.DataFrame(data_2)

In [11]:
dataset_2a

        0   1            2        3
0    Nick  20  Mathematics  Windows
1   Helen  19      Physics  Windows
2   Steve  22   Literature  Windows
3    Mary  21  Mathematics    Linux
4  George  20    Chemistry    MacOS

In [12]:
var_names = ["name", 'age', 'field_of_study', 'os']

In [13]:
dataset_2b = pd.DataFrame(data_2, columns=var_names)

In [14]:
dataset_2b

     name  age field_of_study       os
0    Nick   20    Mathematics  Windows
1   Helen   19        Physics  Windows
2   Steve   22     Literature  Windows
3    Mary   21    Mathematics    Linux
4  George   20      Chemistry    MacOS

#### DataFrame και αρχεία .csv

1. Δημιουργούμε το αρχείο students.csv με έναν editor.
2. Γράφουμε το έξης περιεχόμενο και κάνουμε save.

```
name,age,field_of_stydy,os
Nick,20,Mathematics,Windows
Helen,19,Physics,Windows
Steve,22,Literature,Windows
Mary,21,Mathematics,Linux
George,20,Chemistry,MacOS
```

In [3]:
dataset_3a = pd.read_csv('students.csv')

In [4]:
dataset_3a

     name  age field_of_stydy       os
0    Nick   20    Mathematics  Windows
1   Helen   19        Physics  Windows
2   Steve   22     Literature  Windows
3    Mary   21    Mathematics    Linux
4  George   20      Chemistry    MacOS

In [18]:
dataset_3a.index.values

array([0, 1, 2, 3, 4])

In [19]:
dataset_3a.loc[0]

name                     Nick
age                        20
field_of_stydy    Mathematics
os                    Windows
Name: 0, dtype: object

In [20]:
dataset_3a.iloc[0]

name                     Nick
age                        20
field_of_stydy    Mathematics
os                    Windows
Name: 0, dtype: object

In [21]:
dataset_3b = dataset_3a.set_index('name')

In [22]:
dataset_3b

        age field_of_stydy       os
name
Nick     20    Mathematics  Windows
Helen    19        Physics  Windows
Steve    22     Literature  Windows
Mary     21    Mathematics    Linux
George   20      Chemistry    MacOS

In [23]:
dataset_3b.index.values

array(['Nick', 'Helen', 'Steve', 'Mary', 'George'], dtype=object)

In [24]:
dataset_3b.loc['Nick']

age                        20
field_of_stydy    Mathematics
os                    Windows
Name: Nick, dtype: object

In [26]:
dataset_3b.iloc[1]

age                    19
field_of_stydy    Physics
os                Windows
Name: Helen, dtype: object

In [27]:
dataset_3c = pd.read_csv('./students.csv', index_col='name')

In [28]:
dataset_3c

        age field_of_stydy       os
name
Nick     20    Mathematics  Windows
Helen    19        Physics  Windows
Steve    22     Literature  Windows
Mary     21    Mathematics    Linux
George   20      Chemistry    MacOS

In [29]:
dataset_3d = dataset_3c.drop('os', axis=1)

In [30]:
dataset_3d

        age field_of_stydy
name
Nick     20    Mathematics
Helen    19        Physics
Steve    22     Literature
Mary     21    Mathematics
George   20      Chemistry

In [31]:
dataset_3e = dataset_3c.drop('Nick')

In [32]:
dataset_3e

        age field_of_stydy       os
name
Helen    19        Physics  Windows
Steve    22     Literature  Windows
Mary     21    Mathematics    Linux
George   20      Chemistry    MacOS